token = 'токен скрыт'

Y_LOGIN = 'veramethodologist@mail.ru'
FROM_EMAIL = 'veramethodologist@mail.ru'
MY_PASSWORD = 'пароль скрыт'

Y_SERVER = 'smtp.mail.ru'
Y_PORT = 587

gloss = {u'мрот': u'минимальный размер оплаты труда',
u'дс': u'дополнительное соглашение',
u'гпн': u'ПАО Газпром Нефть',
u'пао': u'публичное акционерное общество',
u'1,5': u'полтора миллиона',
u'1.5': u'полтора миллиона',
u'ндс': u'налог на добавленную стоимость',
u'гпз': u'годовой план закупок',
u' до ': u' дочернее общество ',
u'взл': u'взаимозависимое лицо',
u'згд': u'заместитель Генерального директора',
u'еол': u'единое ответственное лицо',
u'цоуз': u'центральный орган управления закупками',
u'дз': u'департамент закупок',
u'брд': u'блок разведки и добычи',
u'мтр': u'материально-технические ресурсы',
u'дмто': u'департамент материально-технического обеспечения',
u'блпс': u'блок логистики переработки и сбыта',
u'уз': u'Управление закупок',
u'дрп': u'Дирекции региональных продаж',
u'кц': u'корпоративный центр',
u'мсз': u'малостоящие закупки',
u'чс': u'черный список',
u'фз': u'федеральный закон',
u'этп': u'электронная торговая площадка',
u'гпх': u'гражданско-правового характера',
u'нмц': u'начальная (максимальная) цена',
u'ск': u'cтандарт компании',
u'азс': u'автомобильная заправочная станция',
u'еск': u'единый справочник контрагентов',
u'зк': u'закупочная комиссия',
u'зко': u'закупочная комиссия общества',
u' ск ': u' сметная комиссия ',
u'ско': u'сметная комиссия общества',
u'поз ': u'положение о закупках ',
u'азсуз': u'автоматизированная система управления закупками'}



# options1 = "1.1. Изменение цены договора в связи с изменением ставки НДС в связи с изменением законодательства" + "\n \n1.2. Изменение структуры цены договора в связи с изменением ставки НДС, в т.ч. в связи с переходом контрагента на иную систему налогообложения, если это не влечет увеличения цены договора." + "\n \n1.3. Изменения, дополнения, вносимые во исполнение условий рамочного договора, заключенного на условиях п.5.11 Положения о закупках товаров, работ, услуг ПАО «Газпром нефть», не влекущие рост стоимости договора" + "\n \n1.4. Изменение информационных условий договора (изменение реквизитов сторон, банковских реквизитов, контактных данных, уполномоченных представителей сторон)" + "\n \n1.5. Включение в договор утвержденных ПАО «Газпром нефть» типовых условий, не влекущих рост стоимости договора"
# options2 = "\n \n1.6. Изменения, дополнения, вносимые в договор на основании решений/поручений Председателя Правления ПАО «Газпром нефть»/ПАО «Газпром», не влекущие рост стоимости договора" + "\n \n1.7. Обязательные изменения, вносимые в договор в связи с изменением законодательства Российской Федерации, не влекущие рост стоимости договора"
# options3 = "\n \n2.1. Изменение требований к составу и порядку предоставления документации, подтверждающей поставку товаров, выполнение работ, оказание услуг, сопровождающей процесс исполнения договора" + "\n \n2.2. Уменьшение предусмотренного договором объема товаров, работ, услуг с пропорциональным уменьшением общей цены договора на стоимость такого объема" + "\n \n2.3.  Исключение отдельных позиций товаров (операций, работ, элементов) с одновременным увеличением других предусмотренных договором позиций товаров (операций, работ, элементов) без увеличения единичных расценок и общей цены договора (за исключением услуг капитального строительства, по которым предусмотрена разработка и утверждение в установленном порядке проектной/рабочей документации)."
# options4 = "\n \n2.4. Уменьшение единичных расценок (за исключением единичных расценок по услугам капитального строительства, по которым предусмотрена разработка и утверждение в установленном порядке проектной/рабочей документации)." + "\n \n2.5. Изменение сроков/графика поставки товара, выполнения работ, оказания услуг, без увеличения общей цены договора/единичных расценок" + "\n \n2.6. Включение условий об авансировании либо увеличение ранее предусмотренного договором размера авансирования. Изменение графика выплаты и погашения аванса  \n \n_До инициирования вопроса о заключении ДС требуется получение согласования в соответствии с Приказом №99-П от 17.10.2016г. с учетом его изменений и дополнений (если применимо)_" + "\n \n2.7.  Исключение или смягчение требований о предоставлении обеспечения исполнения обязательств \n \n_Согласование банковской гарантии осуществляется в соответствии с КТ-155 (если применимо)_" + "\n \n2.8. Увеличение сроков оплаты товаров, работ, услуг по договору"
# options5 = "\n \n2.9. Изменение порядка оплаты" + "\n \n2.10. Изменения, связанные с привлечением/заменой контрагентом субподрядчика (соисполнителя, субпоставщика) (в случае, если условиями закупки было предусмотрено привлечение субподрядчика (соисполнителя, субпоставщика)) при условии соответствия последнего необходимым квалификационным требованиям (в пределах объема привлечения)." + "\n \n2.11. Изменение стороны по договору вследствие реорганизации юридического лица в форме слияния, присоединения, преобразования юридического лица одной организационно-правовой формы в юридическое лицо другой организационно-правовой формы" + "\n \n2.12. Техническая корректировка предмета договора без изменения вида, объема, состава, стоимости товаров, работ, услуг, в частности: исправление опечаток, изменение названий в связи с переименованием объектов, устранение противоречий" + "\n \n2.13. Досрочное расторжение договора в связи с обоснованным отсутствием у ПАО «Газпром нефть» и/или Общества Газпром нефть дальнейшей потребности в закупаемых товарах, работах, услугах при условии надлежащего исполнения контрагентом своих обязательств либо до начала исполнения обязательств Сторонами согласно условиям договора."
# options6 = "\n \n2.14. Внедрение новых и изменение действующих локальных нормативных документов ПАО «Газпром нефть» или Обществ Газпром нефть" + "\n \n2.15. Изменения, связанные с заменой предусмотренных договором товаров на их эквивалент (аналог) в случае снятия с производства таких товаров или в результате санкционных ограничений без увеличения единичных расценок и общей стоимости договора" + "\n \n2.16. Изменения, дополнения в договоры, связанные с условиями банковского сопровождения в соответствии с установленным регулированием" + "\n \n2.17. Включение новых единичных расценок, разработанных на основе государственной сметно-нормативной базы в соответствии с порядком формирования стоимости выполняемых работ, установленным договором по результатам осуществления закупки (индексы, коэффициенты, формулы и пр.), без увеличения стоимости договора (для услуг капитального строительства, по которым предусмотрена разработка и утверждение в установленном порядке проектной/рабочей документации)(только расценки, которые прошли экспертизу в НТЦ и/или утверждены в ДО в установленном порядке)." + "\n \n2.18. Объединение идентичных договоров, не влекущее рост совокупной стоимости объединяемых договоров."
# options7 = "\n \n2.19. Техническая корректировка сведений относительно сторон договора в связи с переходом арендуемого имущества к новому собственнику" + "\n \n2.20. Продление срока действия договорного документа, не влекущее изменение цены, стоимости, объёма принятых сторонами обязательств, существенные условия договора, а также иных параметров договорного документа, которые влияют (могут повлиять) на эти условия" + "\n \n2.21. Изменения, дополнения к договорам, заключенным по результатам осуществления безальтернативных закупок" + "\n \n2.22. Иные изменения, не поименованные в настоящем каталоге, не являющиеся существенными \n \n_Под существенными изменениями понимаются изменения, дополнения, которые влияют (или могут повлиять в последующем) на основные условия договора – предмет, объем, цену, срок (за исключением п. 2.20), а также иные условия, согласованные сторонами в качестве существенных (при их наличии)_ "
# options8 = "\n \n3.1. Снижение цены договора непропорционально исключаемому объему товаров, работ, услуг" + "\n \n3.2. Включение новых единичных расценок, увеличение единичных расценок без увеличения общей цены по договору, за исключением случаев, предусмотренных п. 2.17 настоящего каталога, а также если иной порядок согласования установлен ЕОЛ." + "\n \n3.3. Сокращение сроков оплаты товаров, работ, услуг, в случае если это не является требованиями законодательства Российской Федерации" + "\n \n3.4. Дополнение и/или усиление ответственности Заказчика равно как уменьшение и/или смягчение ответственности контрагента, за исключением случаев, предусмотренных в п. 1.5-1.7 настоящего каталога" + "\n \n3.5. Расторжение договора, в том числе в одностороннем порядке, включая случаи неисполнения или ненадлежащего исполнения обязательств, за исключением  случая, предусмотренного в п. 2.13 настоящего каталога" + "\n \n3.6 Изменение стороны по договору вследствие прекращения деятельности иностранного юридического лица на территории Российской Федерации (отказа от исполнения обязательств перед российскими юридическими лицами пр.) и продажи или передачи в иной форме обязательств / бизнеса / проектов российскому юридическому лицу, без изменения существенных условий договора и при отсутствии альтернативных контрагентов (либо экономической, временной нецелесообразности или невозможности их привлечения)" + "\n \n3.7. Иные существенные изменения / дополнения, не поименованные в настоящем каталоге"
#
# pers1_1 = "Изменения и дополнения, не требуют предварительного согласования \n \nПод предварительным согласованием понимается согласование возможности изменения, дополнения, расторжения договора, заключенного по результатам закупки, Согласующими лицами до этапа согласования дополнительного соглашения в соответствии с требованиями процесса 08.02.01 «Подготовка, согласование, подписание и регистрация договорных документов в системе электронного документооборота» или иными требованиями подготовки, согласования, подписания и регистрации договорных документов, установленных в Компании и/или Обществе Газпром нефть (в случае отсутствия возможности работы в системе электронного документооборота)."
# pers1_2 = "Порядок и необходимость предварительного согласования определяется на уровне Общества Газпром нефть / подразделения КЦ, ЕОЛ без обязательного согласования с ЦОУЗ.\n \nОбщества Газпром нефть, входящие в периметр действия ОСК-03.07.01 «Система управления исполнением договорных обязательств при выполнении производственных работ/услуг», согласовывают изменения, дополнения и условия расторжения договора, относящиеся к типу 2 в КТ-530, в соответствии с действующими положениями ОСК-03.07.01, а также стандартов на процесс (СК), внедренных в Обществах в развитие ОСК-03.07.01."
# pers2 = "Согласующими лицами являются: \n \n• Руководитель Подразделения корпоративной защиты \n• Руководитель Общества \n• ЕОЛ ДМТО"
# pers3 = "Согласующими лицами являются: \n \n• Руководитель Заказчика \n• Директор Дирекции корпоративной защиты \n• ЗГД по профилю деятельности / Руководитель Структурного подразделения прямого подчинения ГД"
# pers4 = "Согласующими лицами являются: \n \n• Руководитель Подразделения корпоративной защиты  \n• Руководитель Общества \n• ЕОЛ БРД / БЛПС / ДРП"
# pers5 = "Согласующими лицами являются: \n \n• Руководитель Подразделения корпоративной защиты  \n• Руководитель Общества \n• ЗГД по профилю деятельности / Руководитель структурного подразделения прямого подчинения ГД (неприменимо для ДЗиКС)"
# pers6 = "Согласующими лицами являются: \n \n• Руководитель Заказчика \n• Директор Дирекции корпоративной защиты \n• ЗГД по профилю деятельности / Руководитель Структурного подразделения прямого подчинения ГД"
# pers7 = "Согласующими лицами являются: \n \n• Руководитель Подразделения корпоративной защиты  \n• Руководитель Общества"
# pers8 = "Согласующими лицами являются: \n \n• Руководитель Заказчика \n• Директор Дирекции корпоративной защиты"
# pers9 = "Согласующими лицами являются: \n \n• Руководитель Заказчика \n• Директор Дирекции корпоративной защиты \n• ЕОЛ БРД / БЛПС / ДРП"
# pers10 = "Согласующими лицами являются: \n \n• Руководитель Заказчика \n• Директор Дирекции корпоративной защиты \n• ЗГД по профилю деятельности / Руководитель Структурного подразделения прямого подчинения ГД (не применимо для ДЗиКС)"
# pers11 = "Согласующими лицами являются: \n \n• Руководитель Заказчика \n• Директор Дирекции корпоративной защиты \n• ЕОЛ ДМТО \n• Директор профильной дирекции (участвует в согласовании при необходимости) \n \nРешение принимается с обязательным согласованием ЕОЛ ДМТО"
# pers12 = "Согласующими лицами являются: \n \n• Руководитель Заказчика \n• Директор Дирекции корпоративной защиты \n• ЕОЛ БРД / БЛПС / ДРП \n• Директор профильной дирекции (участвует в согласовании при необходимости) \n \nРешение принимается с обязательным согласованием ЕОЛ по направлению деятельности (БРД/БЛПС/ДРП)"
# pers13 = "Согласующими лицами являются: \n \n• Руководитель Заказчика \n• Директор Дирекции корпоративной защиты \n• ЗГД по профилю деятельности / Руководитель Структурного подразделения прямого подчинения ГД (не применимо для ДЗиКС) \n• Директор профильной дирекции (при необходимости) \n \nРешение принимается с обязательным согласованием ДОКЗиКИД/БОРиУ (только для работ/услуг ДО и КЦ вне ЕОЛ)"
# pers14 = "Согласующими лицами являются: \n \n• Руководитель Заказчика \n• Директор Дирекции корпоративной защиты \n• ЕОЛ ДМТО \n• Директор профильной дирекции (при необходимости) \n• ЗГД по профилю деятельности/ Руководитель Структурного подразделения прямого подчинения ГД (не применимо для ДЗиКС)\n \nРешение выносится на рассмотрение Сметной комиссии ГПН"
# pers15 = "Согласующими лицами являются: \n \n• Руководитель Заказчика \n• Директор Дирекции корпоративной защиты \n• ЕОЛ БРД / БЛПС / ДРП \n• Директор профильной дирекции (при необходимости) \n• ЗГД по профилю деятельности / Руководитель структурного подразделения прямого подчинения ГД \n \nРешение выносится на рассмотрение Сметной комиссии ГПН"
# pers16 = "Согласующими лицами являются: \n \n• Руководитель Заказчика \n• Директор Дирекции корпоративной защиты \n• ЗГД по профилю деятельности / Руководитель Структурного подразделения прямого подчинения ГД (неприменимо для ДЗиКС)\n• Директор профильной дирекции (при необходимости) \n \nРешение выносится на рассмотрение Сметной комиссии ГПН"
